bonzehan/stm32xx/src/stm32xx/date.hpp
/*
 * Copyright (c) 2013 by Pawel Tomulik <ptomulik@meil.pw.edu.pl>
 * 
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE
 */

// stm32xx/date.hpp

/** // doc: stm32xx/date.hpp {{{ 
 * @file stm32xx/date.hpp
 * @todo Write documentation
 */ // }}}
#ifndef STM32XX_DATE_HPP_INCLUDED
#define STM32XX_DATE_HPP_INCLUDED

#include <stm32xx/bcd.hpp>
#include <ctime>
#include <cstdint>

#ifndef STM32XX_DATE_YEAR_MIN
/** // doc: STM32XX_DATE_YEAR_MIN {{{
 * @brief Lowest allowed year in stm32xx::date.
 */ // }}}
# define STM32XX_DATE_YEAR_MIN 1582
#endif
#ifndef STM32XX_DATE_YEAR_MAX
/** // doc: STM32XX_DATE_YEAR_MIN {{{
 * @brief Highest allowed year in stm32xx::date.
 */ // }}}
# define STM32XX_DATE_YEAR_MAX 4095
#endif
#ifndef STM32XX_DATE_DEFAULT_YEAR
/** // doc: STM32XX_DATE_DEFAULT_YEAR {{{
 * @brief Default date year, used by stm32xx::date default constructor.
 */ // }}}
# define STM32XX_DATE_DEFAULT_YEAR 2000
#endif
#ifndef STM32XX_DATE_DEFAULT_MON
/** // doc: STM32XX_DATE_DEFAULT_MON {{{
 * @brief Default date month, used by stm32xx::date default constructor.
 */ // }}}
# define STM32XX_DATE_DEFAULT_MON 1
#endif
#ifndef STM32XX_DATE_DEFAULT_MDAY
/** // doc: STM32XX_DATE_DEFAULT_MDAY {{{
 * @brief Default date month, used by stm32xx::date default constructor.
 */ // }}}
# define STM32XX_DATE_DEFAULT_MDAY 1
#endif
#ifndef STM32XX_DATE_YEAR_T
/** // doc: STM32XX_DATE_YEAR_T {{{
 * @brief Integer type to be used by stm32xx::date to represent years.
 */ // }}}
# define STM32XX_DATE_YEAR_T int16_t
#endif
#ifndef STM32XX_DATE_MON_T
/** // doc: STM32XX_DATE_MON_T {{{
 * @brief Integer type to be used by stm32xx::date to represent months.
 */ // }}}
# define STM32XX_DATE_MON_T int8_t
#endif
#ifndef STM32XX_DATE_MDAY_T
/** // doc: STM32XX_DATE_MDAY_T {{{
 * @brief Integer type to be used by stm32xx::date to represent days of month.
 */ // }}}
# define STM32XX_DATE_MDAY_T int8_t
#endif
#ifndef STM32XX_DATE_YDAY_T
/** // doc: STM32XX_DATE_YDAY_T {{{
 * @brief Integer type to be used by stm32xx::date to represent days of year.
 */ // }}}
# define STM32XX_DATE_YDAY_T uint16_t
#endif

#if ((STM32XX_DATE_YEAR_MIN) < 0)
# error "STM32XX_DATE_YEAR_MIN must be non-negative"
#endif
#if ((STM32XX_DATE_YEAR_MAX) > 4095)
# error "STM32XX_DATE_YEAR_MAX must be less than 4095"
#endif
#if ((STM32XX_DATE_YEAR_MIN) >= (STM32XX_DATE_YEAR_MAX))
# error "STM32XX_DATE_YEAR_MIN must be less than STM32XX_DATE_YEAR_MAX"
#endif


namespace stm32xx {

/** // doc: stm32xx::date {{{
 * @brief Represent and/or manipulate dates
 *
 * The stm32xx::date object may be used to represent and manipulate calendar
 * date. The date is stored in binary form (as three integer numbers) and
 * consists of:
 *
 * - year (read with year() method),
 * - month (read with mon() method),
 * - day of month (read with mday() method),
 *
 * You may change default types used to represent year, month and day of month
 * by defining preprocessor constants: @ref STM32XX_DATE_YEAR_T, @ref
 * STM32XX_DATE_MON_T and @ref STM32XX_DATE_MDAY_T.
 *
 * <b>Other characteristics</b>
 *
 * Other date characteristics, such as day of the year or day of the week may
 * be computed from year, month and day of the month contained in date object.
 * The relevant methods are wday(), yday(), leap_year(), mdays().
 *
 * <b>Initialization and modification</b>
 *
 * The date may be initialized by constructors and/or set by setter methods:
 * set_year(), set_mon() and set_mday(). 
 *
 * @note Neither the constructors nor setters prevent from setting an invalid
 * date (February 31, for example). Your application should validate user's
 * input when setting date or check the date correctness on newly created or
 * modified dates (see date_valid()). For simple applications it's fair enough
 * to just blindly round the dates to a "nearest" valid date by clamp_date()
 * method, for example:
 * @code
 * stm32xx::date d(2013,2,31);  // 2013-02-31 (invalid date)
 * d.clamp_date();              // 2013-02-28 (corrected date)
 * @endcode
 *
 * @note Dates before Oct 15, 1582 are regarded as invalid, and are rounded by
 * clamp_date() to Oct 15, 1582..
 *
 * The date may also be modified by using inc_year(), dec_year(), inc_mon(),
 * dec_mon(), inc_mday(), dec_mday() methods. They may be used to implement
 * button-driven user interfaces for setting calendar date.
 *
 * @note The date after dec_year(), inc_year(), dec_mon() or inc_mon() may
 * become invalid. It is advised to check its validity or just clamp_date()
 * before using it further. Below are some examples of the possible situations
 * that require correcting
 * actions. \n
 * 1. Example with inc_mon():
 *    @code
 *    stm32xx::date d(2013,1,31);  // 2013-01-31 (valid)
 *    d.inc_mon();                 // 2013-02-31 (invalid)
 *    d.clamp_date();              // 2013-02-28 (corrected)
 *    @endcode
 * 2. Example with inc_year():
 *    @code
 *    stm32xx::date d(2012,2,29);  // 2012-02-29 (valid, 2012 is a leap year)
 *    d.inc_year();                // 2013-02-29 (invalid, 2013 is not a leap year)
 *    d.clamp_date();              // 2013-02-28 (corrected)
 *    @endcode
 *
 * <b>Support for RTC timers</b>
 *
 * @note The following description only shows how to handle date, isolated
 * from daytime information. Instructions regarding complete information
 * (including date and daytime) may be found in documentation of
 * stm32xx::datetime.
 *
 * There are several ways to implement RTC-based calendar with stm32xx::date.
 *
 * <b>Devices without hardware clock/calendar</b>:
 *
 * On devices with no hardware clock/calendar functionality one usually stores
 * date in RTC backup domain and uses RTC_CNT counter to measure time offset
 * of the current time from the date stored in backup registers (in seconds).
 *
 * The first approach is to initialize the stm32xx::date object every second
 * (in RTC interrupt, for example) using the above pieces of information,
 * update RTC counter, and store updated date in backup registers, for example:
 *
 * - at each second do:
 * @code
 * date d(restore_date() + RTC->CNT/86400);
 * RTC->CNT = RTC_CNT % 86400;
 * store_date(d.gday());
 * @endcode
 * where @c restore_date() is some function that reads date stored in RTC
 * backup registers and store_date() does the opposite.
 *
 * Other applications may prefer to initialize @ref date object from backed-up
 * values once at startup and utilize the inc_date() to update a @ref date
 * object at midnight.
 * - at startup do:
 *   @code
 *   // d is a static object.
 *   d.set_date(restore_date() + RTC->CNT/86400);
 *   RTC->CNT = RTC->CNT % 86400;
 *   store_date(d.gday());
 *   @endcode
 * - at each midnight do:
 *   @code
 *   d.inc_date();
 *   RTC->CNT -= 86400;
 *   store_date(d.gday());
 *   @endcode
 *
 * <b>Devices with hardware clock/calendar</b>:
 *
 * Some of the STM32 MCUs are equipped with hardware RTC calendar (see AN3371
 * and reference manuals for the relevant MCUs). These chips store date as
 * packed BCD code in RTC_DR register and the daytime in separate RTC_TR
 * register. These chips do not require the application to maintain seconds'
 * counter as in previous examples. Also the date (and time) registers are
 * updated automatically, so there is no need for manipulating date within
 * periodic RTC interrupt handlers unless one needs to handle daylight saving
 * time update, for example. For such cases the initialization of stm32xx::date
 * simplifies to:
 * @code
 * date d(from_rtc_dr(RTC->DR,2000)); // subtract 2000 from value being stored
 * @endcode
 * Storing modified date is also easy:
 * @code
 * // for appropriate mask see reference manual for your target MCU, 
 * // this example is for STM32F4xx.
 * RTC->DR = d.to_rtc_dr(2000) & 0x00FFFF3Ful;
 * @endcode
 * The stm32xx::date class is able to convert date from and to the format
 * compatible with RTC_DR register. The relevant methods are from_rtc_dr() and
 * to_rtc_dr().
 *
 * <b>Support for Daylight Saving Time changes</b>:
 *
 * These methods may be used to determine when the summer and winter time
 * starts: dst_summer_gday(), dst_winter_gday(), dst_summer_gday(int32_t),
 * dst_winter_gday(int32_t).
 *
 * <b>Converting to BCD codes</b>
 *
 * The date, as well as its parts, may be converted to packed BCD codes (this
 * shall simplify development of application with BCD-based displays). The
 * relevant methods are year_bcdp(), mon_bcdp(), mday_bcdp(), wday_bcdp(),
 * and date_bcdp().
 *
 * <b>Overloaded operators</b>
 *
 * The following operartors are overloaded:
 * - comparison: operator==(), operator!=(), operator<(), operator<=(),
 *   operator>(), operator>=().
 * - advance date: operator+=(), operator-=(),
 * - plus/minus: operator+(stm32xx::date const&,int32_t), 
 *               operator-(stm32xx::date const&,int32_t).
 */ // }}}
class date
{
public: /* types */
  /// Integer type used by stm32xx::date to represent years.
  typedef STM32XX_DATE_YEAR_T year_t;
  /// Integer type used by stm32xx::date to represent months.
  typedef STM32XX_DATE_MON_T mon_t;
  /// Integer type used by stm32xx::date to represent days of year.
  typedef STM32XX_DATE_YDAY_T yday_t;
  /// Integer type used by stm32xx::date to represent days of month.
  typedef STM32XX_DATE_MDAY_T mday_t;
  /// Enum used to represent days of week.
  enum wday_t
    {
      wday_mon = 1,
      wday_tue,
      wday_wed,
      wday_thu,
      wday_fri,
      wday_sat,
      wday_sun,
    };
  /// Signed integer used to represent day count (since 0000:03:01).
  typedef int32_t gday_t;

public: /* member methods */
  /** // doc: date() {{{
   * @brief Default constructor
   *
   * By default, the date is initialized with the following values:
   *
   * - year:  @ref STM32XX_DATE_DEFAULT_YEAR
   * - month: @ref STM32XX_DATE_DEFAULT_MON
   * - mday:  @ref STM32XX_DATE_DEFAULT_MDAY
   */ // }}}
  constexpr date() noexcept
    : _M_year(STM32XX_DATE_DEFAULT_YEAR), 
      _M_mon(STM32XX_DATE_DEFAULT_MON),
      _M_mday(STM32XX_DATE_DEFAULT_MDAY)
  {
  }
  /** // doc: date(y,m,d) {{{
   * @brief Constructor
   *
   * @param y year, an integer in range <tt>[@ref STM32XX_DATE_YEAR_MIN ..
   *        @ref STM32XX_DATE_YEAR_MAX]</tt>,
   * @param m month, an integer in range <tt>[1..12]</tt>,
   * @param d day of month, an integer in range <tt>[1..date::mdays(y,m)]</tt>.
   * @note The provided values for @c y, @c m and @c d are neither checked nor
   *       corrected. If these values are entered by user, consider validating
   *       them before passing as arguments to the constructor. Alternativelly
   *       clamp_date() may be used to correct invalid date object.
   */ // }}}
  constexpr date(year_t y, mon_t m, mday_t d) noexcept
    : _M_year(y), _M_mon(m), _M_mday(d)
  {
  }

