bonzehan/stm32xx/src/stm32xx/date.hpp
  /* validation and munging */
  /// Does this object represent a valid date?
  constexpr bool date_valid() const noexcept
  {
    return (this->year() >= STM32XX_DATE_YEAR_MIN) 
        && (this->year() <= STM32XX_DATE_YEAR_MAX)
        && (this->mon()  >=  1)
        && (this->mon()  <= 12)
        && (this->mday() >=  1)
        && (this->mday() <= this->mdays());
  }
  /// Round the date to a nearest valid value.
  void clamp_date() noexcept;

  /* convienience methods for setting date from UI */
  /** // doc: dec_year() {{{
   * @brief Decrease year by one (with wrapping).
   *
   * Decrease year by one. If initially <tt>year()<=STM32XX_DATE_YEAR_MIN</tt>,
   * it is set back to @c STM32XX_DATE_YEAR_MAX. 
   *
   * @note The date may become invalid after dec_year(). It is advised to
   *       clamp_date() it before using it further.
   *
   * The main purpose of this method is to let user interfaces to easily modify
   * the date.
   */ // }}}
  void dec_year() noexcept;
  /** // doc: inc_year() {{{
   * @brief Increase year by one (with wrapping).
   *
   * Increase year by one. If initially <tt>year()>=STM32XX_DATE_YEAR_MAX</tt>,
   * it is set back to @c STM32XX_DATE_YEAR_MIN.
   *
   * @note The date may become invalid after inc_year(). It is advised to
   *       clamp_date() it before using it further.
   *
   * The main purpose of this method is to let user interfaces to easily modify
   * the date.
   */ // }}}
  void inc_year() noexcept;
  /** // doc: dec_mon() {{{
   * @brief Decrease month by one (with wrapping).
   *
   * Decrease month by one. If initially <tt>mon()<=1</tt> (January), it is set
   * back (wrapped) to @c 12 (December).
   *
   * @note The date may become invalid after dec_mon(). It is advised to
   *       clamp_date() it before using it further.
   *
   * The main purpose of this method is to let user interfaces to easily modify
   * the date.
   */ // }}}
  void dec_mon() noexcept;
  /** // doc: inc_mon() {{{
   * @brief Increase month by one (with wrapping).
   *
   * Increase month by one. If initially <tt>mon()>=12</tt> (December),
   * it is set back (wrapped) to @c 1 (January).
   *
   * @note The date may become invalid after inc_mon(). It is advised to
   *       clamp_date() it before using it further.
   *
   * The main purpose of this method is to let user interfaces to easily modify
   * the date.
   */ // }}}
  void inc_mon() noexcept;
  /** // doc: dec_mday() {{{
   * @brief Decrease month day by one (with wrapping).
   *
   * Decrease day of the month. If initially <tt>mday()<=1</tt>, it is
   * set back (wrapped) to <tt>date::mdays(year(),mon())</tt>.
   *
   * The main purpose of this method is to let user interfaces to easily modify
   * the date.
   */ // }}}
  void dec_mday() noexcept;
  /** // doc: inc_mday() {{{
   * @brief Increase month day by one (with wrapping).
   *
   * Increase day of the month. If initially
   * <tt>mday()>=date::mdays(year(),mon())</tt> it is set back (wrapped) to
   * @c 1.
   *
   * The main purpose of this method is to let user interfaces to easily modify
   * the date.
   */ // }}}
  void inc_mday() noexcept;

  /* methods for updating date by RTC */
  /** // doc: inc_date() {{{
   * @brief Move the date forward by one day.
   *
   * The main purpose of this method is to let RTC easily update the date as
   * midnight passes.
   *
   * @return @c true if calendar wrap occured (STM32XX_DATE_YEAR_MAX passed)
   */ // }}}
  bool inc_date() noexcept;
  /** // doc: advance_date() {{{
   * @brief Move the date forward by a number of days.
   * @param days number of days to add to current date (possibly negative).
   *
   * @note As oposse to inc_date(), this method does not guarantee that date is
   * in range after operation. It's possible to go past STM32XX_DATE_YEAR_MAX
   * or before STM32XX_DATE_YEAR_MIN.
   *
   * The main purpose of this method is to let RTC easily update the date.
   */ // }}}
  void advance_date(int32_t days) noexcept
  {
    this->set_date(days + gday());
  }

  /* accessors */
  /// Get year.
  constexpr year_t year() const noexcept { return this->_M_year; }
  /// Get month.
  constexpr mon_t mon() const noexcept { return this->_M_mon; }
  /// Get day of month.
  constexpr mday_t mday() const noexcept { return this->_M_mday; }
  /// Set year
  inline void set_year(year_t y) noexcept { this->_M_year = y; }
  /// Set month
  inline void set_mon(mon_t m) noexcept { this->_M_mon = m; }
  /// Set day of month
  inline void set_mday(mday_t d) noexcept { this->_M_mday = d; }
  /// Set date
  inline void set_date(date const& other) noexcept { *this = other; }
  /// Set date
  inline void set_date(gday_t g) noexcept { this->set_date(from_gday(g)); }

  /* comparison operators */
  /// operator ==
  constexpr bool 
  operator == (date const& other) const noexcept
  {
    return (this->mday() == other.mday()) 
        && (this->mon() == other.mon())
        && (this->year() == other.year());
  }
  /// operator !=
  constexpr bool
  operator != (date const& other) const noexcept
  {
    return !((*this) == other);
  }
  /// operator <
  constexpr bool
  operator < (date const& other) const noexcept
  {
    return (this->year() < other.year()) ||
      ( 
        (this->year() == other.year()) && 
        ( 
          (this->mon() < other.mon()) ||
          (
            (this->mon() == other.mon()) && 
            (this->mday()<other.mday())
          )
        )
      );
  }
  /// operator >
  constexpr bool
  operator > (date const& other) const noexcept
  {
    return other < (*this);
  }
  /// operator <=
  constexpr bool
  operator <= (date const& other) const noexcept
  {
    return !((*this) > other);
  }
  /// operator >=
  constexpr bool
  operator >= (date const& other) const noexcept
  {
    return !((*this) < other);
  }
  /// operator +=
  inline date& operator += (int32_t days) noexcept
  {
    this->advance_date(days);
    return *this;
  }
  /// operator -=
  inline date& operator -= (int32_t days) noexcept
  {
    this->advance_date(-days);
    return *this;
  }

  /* other methods */
  /** // doc: gday() {{{
   * @fn gday_t stm32xx::date::gday() const
   * @brief Get Lilian Day Number (computed from year(), mon(), mday()).
   *
   * Equivalent to, <tt>gday(this->year(),this->mon(),this->mday())</tt>,
   * see @ref gday(int32_t, int32_t, int32_t).
   */ // }}}
  constexpr gday_t gday() const noexcept
  {
    return gday(this->year(), this->mon(), this->mday());
  }
  /// Get day of year for this date (computed from year(), mon() and mday()).
  inline yday_t yday() const noexcept 
  {
    return yday(this->year(), this->mon(), this->mday()); 
  }
  /// Get day of week for this date (computed from year(), mon() and mday()).
  constexpr wday_t wday() const noexcept 
  {
    return (wday_t)wday(this->gday()); 
  }
  /// Do we have a leap year?
  constexpr gday_t leap_year() const noexcept 
  {
    return leap_year(this->year());
  }
  /// How many days the current month has?
  constexpr mday_t mdays() const noexcept
  {
    return date::mdays(this->year(), this->mon());
  }
  /// First day of summer time (Daylight Saving Time)
  constexpr gday_t dst_summer_yday() const noexcept
  {
    return dst_summer_yday(this->year());
  }
  /// First day of winter time (Daylight Saving Time)
  constexpr gday_t dst_winter_yday() const noexcept
  {
    return dst_winter_yday(this->year());
  }
  /** // doc: year_bcdp() {{{
   * @brief Return year (year()) as packed BCD code.
   *
   * @param yoff year offset, the value gets subtracted from year() before
   *        encoding.
   * @return year converted to packed BCD code.
   *
   * The value returned by year_bcdp() has the following format:
   * @verbatim
      31   30   29   28   27   26   25   24   23   22   21   20   19   18   17   16  
     +------------------------------------------------------------------------------+
     :                                      0                                       :
     +------------------------------------------------------------------------------+
    
