bonzehan/stm32xx/src/stm32xx/date.hpp
      15   14   13   12   11   10    9    8    7    6    5    4    3    2    1    0
     +------------------+-------------------+-------------------+-------------------+
     :    YTT[3:0]      :     YH[3:0]       :      YT[3:0]      :       YU[3:0]     :
     +------------------+-------------------+-------------------+-------------------+
     @endverbatim
   * with the bits defined as:
   * - bits 15:12 <b>YTT[3:0]</b> year thousands,
   * - bits 11:8  <b>YH[3:0]</b> year hundreds,
   * - bits  7:4  <b>YT[3:0]</b> year tens in BCD format
   * - bits  3:0  <b>YU[3:0]</b> year uints in BCD format
   */ // }}}
  constexpr uint32_t year_bcdp(int32_t yoff=0) const noexcept
  {
    return bcdp<4>::encode((uint32_t)(this->year()-yoff));
  }
  /** // doc: mon_bcdp() {{{
   * @brief Return month (mon()) as packed BCD code.
   * @return month converted to packed BCD code.
   *
   * The value returned by mon_bcdp() has the following format:
   * @verbatim
      31   30   29   28   27   26   25   24   23   22   21   20   19   18   17   16  
     +------------------------------------------------------------------------------+
     :                                      0                                       :
     +------------------------------------------------------------------------------+
    
      15   14   13   12   11   10    9    8    7    6    5    4    3    2    1    0
     +-----------------------------------------------------+----+-------------------+
     :                          0                          : MT :       MU[3:0]     :
     +-----------------------------------------------------+----+-------------------+
     @endverbatim
   * with the bits defined as:
   * - bit 4  <b>MT</b>: month tens in BCD format,
   * - bits 3:0 <b>MU</b> month units in BCD format,
   */ // }}}
  constexpr uint32_t mon_bcdp() const noexcept
  {
    return bcdp<2>::encode((uint32_t)this->mon());
  }
  /** // doc: mday_bcdp() {{{
   * @brief Return day of month (mday()) as packed BCD code.
   * @return day of month month converted to packed BCD code (32-bit word).
   *
   * The value returned by mday_bcdp() has the following format:
   * @verbatim
      31   30   29   28   27   26   25   24   23   22   21   20   19   18   17   16  
     +------------------------------------------------------------------------------+
     :                                      0                                       :
     +------------------------------------------------------------------------------+
    
      15   14   13   12   11   10    9    8    7    6    5    4    3    2    1    0
     +-------------------------------------------------+--------+-------------------+
     :                          0                      : DT[1:0]:      DU[3:0]      :
     +-------------------------------------------------+--------+-------------------+
     @endverbatim
   * with the bits defined as:
   * - bits 5:4 <b>DT[1:0]</b> day tens in BCD format,
   * - bits 3:0 <b>DU[3:0]</b> day units in BCD format,
   */ // }}}
  constexpr uint32_t mday_bcdp() const noexcept
  {
    return bcdp<2>::encode((uint32_t)this->mday());
  }
  /** // doc: mday_bcdp() {{{
   * @brief Return day of week (wday()) as packed BCD code.
   * @return day of week converted to packed BCD code (32-bit word).
   *
   * The value returned by mday_bcdp() has the following format:
   * @verbatim
      31   30   29   28   27   26   25   24   23   22   21   20   19   18   17   16  
     +------------------------------------------------------------------------------+
     :                                      0                                       :
     +------------------------------------------------------------------------------+
    
      15   14   13   12   11   10    9    8    7    6    5    4    3    2    1    0
     +---------------------------------------------------------------+--------------+
     :                                  0                            :   WDU[2:0]   :
     +---------------------------------------------------------------+--------------+
     @endverbatim
   * with the bits defined as:
   * - bits 2:0 <b>WDU[2:0]</b> day units in BCD format,
   */ // }}}
  constexpr uint32_t wday_bcdp() const noexcept
  {
    return bcdp<1>::encode((uint32_t)this->wday() & (uint32_t)0x7);
  }
  /** // doc: date_bcdp() {{{
   * @brief Return the date converted to 32-bit packed BCD code.
   *
   * @param yoff year offset, the value is subtracted from year() before
   *        encoding.
   * @return date converted to packed BCD code (32-bit word).
   *
   * The value returned by date_bcdp() has the following format:
   * @verbatim
      31   30   29   28   27   26   25   24   23   22   21   20   19   18   17   16  
     +------------------+-------------------+-------------------+-------------------+
     :    YTT[3:0]      :     YH[3:0]       :      YT[3:0]      :       YU[3:0]     :
     +------------------+-------------------+-------------------+-------------------+
    
      15   14   13   12   11   10    9    8    7    6    5    4    3    2    1    0
     +-------------+----+-------------------+----------+--------+-------------------+
     :       0     : MT :     MU[3:0]       :     0    : DT[1:0]:      DU[3:0]      :
     +-------------+----+-------------------+----------+--------+-------------------+
     @endverbatim
   * The bits are defined as:
   * - bits 31:28 <b>YTT[3:0]</b> year thousands in BCD format,
   * - bits 27:24 <b>YH[3:0]</b> year hundreds in BCD format,
   * - bits 23:20 <b>YT[3:0]</b> year tens in BCD format
   * - bits 19:16 <b>YU[3:0]</b> year uints in BCD format
   * - bits 15:13 <b>zeros</b>,
   * - bit 12 <b>MT</b>: month tens in BCD format,
   * - bits 11:8 <b>MU</b> month units in BCD format,
   * - bits 7:6 <b>zeros</b>,
   * - bits 5:4 <b>DT[1:0]</b> date tens in BCD format,
   * - bits 3:0 <b>DU[3:0]</b> date units in BCD format,
   */ // }}}
  constexpr uint32_t date_bcdp(int32_t yoff = 0) const noexcept
  {
    return  (this->year_bcdp(yoff)  << 16)
          | (this->mon_bcdp()       << 8)
          |  this->mday_bcdp();
  }
  /** // doc: to_rtc_dr() {{{
   * @brief Return the date as 32-bit value compatible with RTC_DR.
   *
   * @param yoff year offset, the value is subtracted from year() before
   *        encoding.
   *
   * This method returns the date converted to a format compatible with RTC_DR
   * register. The RTC_DR register is present in MCUs equipped with hardware
   * RTC calendar.
   *
   * The RTC_DR register has the following layout:
   * @verbatim
      31   30   29   28   27   26   25   24   23   22   21   20   19   18   17   16  
     +--------------------------------------+-------------------+-------------------+
     :             reserved                 :      YT[3:0]      :       YU[3:0]     :
     +--------------------------------------+-------------------+-------------------+
    
