bonzehan/stm32xx/src/stm32xx/date.hpp
      15   14   13   12   11   10    9    8    7    6    5    4    3    2    1    0
     +-------------+----+-------------------+----------+--------+-------------------+
     :   WDU[2:0]  : MT :     MU[3:0]       : reserved : DT[1:0]:      DU[3:0]      :
     +-------------+----+-------------------+----------+--------+-------------------+
     @endverbatim
   * with the bits defined as:
   *
   * - bits 31:24 are reserved
   * - bits 23:20 <b>YT[3:0]</b> year tens in BCD format
   * - bits 19:16 <b>YU[3:0]</b> year uints in BCD format
   * - bits 15:13 <b>WDU[2:0]</b> week day units:
   *   - 000: forbidden
   *   - 001: Mogday
   *   - ...
   *   - 111: Sugday
   * - bit 12 <b>MT</b>: month tens in BCD format,
   * - bits 11:8 <b>MU</b> month units in BCD format,
   * - bits 7:6 reserved, must be keept at reset value,
   * - bits 5:4 <b>DT[1:0]</b> date tens in BCD format,
   * - bits 3:0 <b>DU[3:0]</b> date units in BCD format,
   *
   * The value returned by to_rtc_dr() has similar format, but it uses also 
   * bits 31:28 (which are reserved in RTC_DR): 
   * @verbatim
      31   30   29   28   27   26   25   24   23   22   21   20   19   18   17   16  
     +------------------+-------------------+-------------------+-------------------+
     :    YTT[3:0]      :     YH[3:0]       :      YT[3:0]      :       YU[3:0]     :
     +------------------+-------------------+-------------------+-------------------+
    
      15   14   13   12   11   10    9    8    7    6    5    4    3    2    1    0
     +-------------+----+-------------------+----------+--------+-------------------+
     :   WDU[2:0]  : MT :     MU[3:0]       :    0     : DT[1:0]:      DU[3:0]      :
     +-------------+----+-------------------+----------+--------+-------------------+
     @endverbatim
   * The bits 31:24 are defined as:
   * - bits 31:28 <b>YTT[3:0]</b> year thousands in BCD format,
   * - bits 27:24 <b>YH[3:0]</b> year hundreds in BCD format,
   *
   * With the additional bits the conversion is lossless. The extra bits can be
   * easily masked-out when setting to physical RTC_DR register.
   */ // }}}
  constexpr uint32_t to_rtc_dr(int32_t yoff = 0) const noexcept
  {
    return  this->date_bcdp(yoff) | (this->wday_bcdp() << 13);
  }

protected: /* members */
  year_t _M_year;
  mon_t _M_mon;
  mday_t _M_mday;

public: /* static methods */
  /** // doc: from_rtc_dr(y) {{{
   * @brief Create new date from RTC_DR value.
   * @param dr the input value; should have same format as the value returned
   *        by to_rtc_dr() or date_bcdp().
   * @param yoff year offset, this value is added to year value decoded from
   *        @c dr.
   *
   * @note The week day (WDU[2:0]) bits in @c dr are ignored.
   *
   * @return a new stm32xx::date object.
   */ // }}}
  constexpr static date from_rtc_dr(uint32_t dr, int32_t yoff = 0) noexcept
  {
    return date(  bcdp<4>::decode((dr&0xFFFF0000ul) >> 16) + yoff,
                  bcdp<2>::decode((dr&0x00001F00ul) >>  8),
                  bcdp<2>::decode( dr&0x0000003Ful) );
  }
  /** doc: from_gday() {{{
   * @brief Create new date from day number.
   *
   * @param g day number as returned by gday(year_t,mon_t,mday_t)
   * @return a new stm32xx::date object
   */ // }}}
  static date from_gday(gday_t g) noexcept;
  /** // doc: gday(y,m,d) {{{
   * @fn int32_t stm32xx::date::gday(int32_t,int32_t, int32_t)
   * @brief Convert Gregorian date to Lilian Day Number.
   *
   * @param y year, an integer <tt> >= 1582</tt>,
   * @param m month, an integer in range [1 .. 12],
   * @param d day of month, an integer in range [1 .. mdays(y,m)],
   * @return the Lilian Day Number.
   *
   * @note Correct results are guaranteed only for dates equal to or latter
   * than @c Oct 15, 1582. Oct 15, 1582 is the first day of Gregorian calendar
   * and is preceded by Oct 4, 1582 of the Julian Calendar (old calendar).
   * Results obtained for earlier dates are generally invalid (Julian Calendar
   * has different concept of leap years).
   *
   * This function converts a Gregorian date (year, month, day) to an integer
   * denoting number of days elapsed since Oct 14, 1582 AD (day no. 0). The
   * returned value is simply the Lilian Day Number. The Lilian Day 1 is the
   * first day of the Gregorian calendar. 
   *
   * <b>Beginning of Gregorian Calendar</b>:
   * @verbatim
     Oct, 1582:

     Mon Tue Wed Thu Fri Sat Sun
                     15  16  17
     18  19  20  21  22  23  24
     25  26  27  28  29  30  31
     @endverbatim
   *
   * The formula used to determine the day number is equivalent to function:
   * @code
   * function g(y,m,d)
   *   m = (m+9) % 12
   *   y = y - m/10
   *   return 365*y + y/4 - y/100 + y/400 + (m*306 + 5)/10 + ( d - 1) - 578040
   * @endcode
   *
   * taken from
   *
   * - http://alcor.concordia.ca/~gpkatch/gdate-algorithm.html
   *
   * with a minor modification (offset 578040).
   *
   * The offset <tt>578040 == number of days between Oct 15, 1582 and Mar 1,
   * 0000)</tt>.
   *
   * <b>The formula for day of week</b>:
   *
   * This follows from the properties of Lilian Day Number:
   * @code
   * g = gday(y,m,d)
   * wday = 1 + (3 + (g % 7))
   * @endcode
   * where, <tt>1 => Mon</tt>, <tt>2 => Tue</tt>, ..., <tt>7 => Sun</tt>.
   */ // }}}
  constexpr static int32_t gday(int32_t y, int32_t m, int32_t d) noexcept
  {
    return (m<3) ? gday_f(y-1, m+9, d) : gday_f(y, m-3, d);
  }
  // -
  constexpr static int32_t gday_f(int32_t y, int32_t m, int32_t d) noexcept
  {
    return 365*y + y/4 - y/100 + y/400 + (m*306+5)/10 + (d-1) - 578040;
  }
  /** // doc: yday(y,m,d) {{{
   * @brief Given a date (year, month, day of month) determine day of year.
   * @param y year, an integer in range <tt>[@ref STM32XX_DATE_YEAR_MIN ..
   *        @ref STM32XX_DATE_YEAR_MAX]</tt>,
   * @param m month, an integer in range <tt>[1 .. 12]</tt>,
   * @param d day of month, an integer in range <tt>[1 .. mdays(y,m)]</tt>,
   * @return an integer from range <tt>[0 .. 364]</tt> or <tt>[0 .. 365]</tt>
   * (leap year).
   */ // }}}
  constexpr static int32_t yday(int32_t y, int32_t m, int32_t d) noexcept
  {
    return gday(y,m,d) - gday(y,1,1);
  }
  /** // doc: wday() {{{
   * @brief Given a date (year, month, day of month) determine day of week.
   * @param g day number, as returned by gday(year_t,mon_t,mday_t)
   * @return an enum naming the day of week of given date @c d.
   */ // }}}
  constexpr static int32_t wday(int32_t g) noexcept
  {
    return (wday_t)(1 + ((3+g) % 7));
  }
  /** // doc: mdays(y,m) {{{
   * @brief Return number of days in a month.
   * @param y year, an integer in range <tt>[@ref STM32XX_DATE_YEAR_MIN ..
   *          @ref STM32XX_DATE_YEAR_MAX]</tt>,
   * @param m month, an integer in range <tt>[1 .. 12]</tt>
   * @return number of days in the month @c m &mdash; an integer from range
   *         <tt>[28 .. 31]</tt>.
   */ // }}}
  constexpr static int32_t mdays(int32_t y, int32_t m) noexcept
  {
    return (m == 2) ? (28 + leap_year(y)) : 30 + ((m + (m>>3))&0x1);
  }
  /** // doc: leap_year() {{{
   * @brief Is this a leap year?
   * @param y year, an integer in range <tt>[@ref STM32XX_DATE_YEAR_MIN ..
   *        @ref STM32XX_DATE_YEAR_MAX]</tt>
   * @return @c 1 if @c y is a leap year, or @c 0 if not.
   */ // }}}
  constexpr static int32_t leap_year(int32_t y) noexcept
  {
    return ((y%400) == 0) ? 1: (((y%100) == 0) ? 0: ((y%4)==0) ? 1 : 0);
  }
  /** // doc: dst_summer_gday(y) {{{
   * @fn int32_t dst_summer_gday(int32_t)
   * @brief Determine the first day of summer time of year @c y.
   * @param y year, an integer value
   * @return day number of the first day of summer time of year @c y, relative
   * to Jan 1 of the year @c y.
   * @brief 
   */ // }}}
  constexpr static int32_t dst_summer_yday(int32_t y) noexcept
  {
    // FIXME: this rule shouldn't be hardcoded (it works for EU, not for others)
    return find_wday(gday(y,4,1), wday_sun, -1) - gday(y,1,1);
  }
  /** // doc: dst_winter_gday(y) {{{
   * @fn int32_t dst_winter_gday(int32_t)
   * @brief Determine the first day of winter time of year @c y.
   * @param y year, an integer value
   * @return day number of the first day of winter time of year @c y, relative
   * to Jan 1 of the year @c y.
   * @brief 
   */ // }}}
  constexpr static int32_t dst_winter_yday(int32_t y) noexcept
  {
    // FIXME: this rule shouldn't be hardcoded (it works for EU, not for others)
    return find_wday(gday(y,11,1), wday_sun, -1) - gday(y,1,1);
  }
  /** // doc: find_wday(g, w, n) {{{
   * @brief Find particular day of week in calendar.
   * @param g Lilian Day Number of the search base,
   * @param w day of the week to find
   * @param n number of weeks to add to the result
   * @return Lilian Day Number of the day found
   *
   * Given a Lilian Day Number of a base day and the name of week day, this
   * method searches forward for that week day.
   *
   * <b>Examples</b>:
   *
   * 1. Find first Friday of Oct, 2013:
   *    @code
   *    find_wday(gday(2013,10,1), wday_fri);     // -> Oct 4, 2013
   *    @endcode
   * 2. Find second Friday of Oct, 2013:
   *    @code
   *    find_wday(gday(2013,10,1), wday_fri, 1);  // -> Oct 11, 2013
   *    @endcode
   * 3. Find last Sunday of October, 2013:
   *    @code
   *    find_wday(gday(2013,11,1), wday_fri,-1);  // -> Oct 27, 2013
   *    @endcode
   * 4. Find nearest Friday, starting from Oct 4, 2013:
   *    @code
   *    find_wday(gday(2013,10,4), wday_fri);     // -> Oct 4, 2013
   *    @endcode
   * 5. Find Friday prior to Oct 4, 2013:
   *    @code
   *    find_wday(gday(2013,10,4), wday_fri, -1); // -> Sep 27, 2013
   *    @endcode
   */ // }}}
  constexpr static int32_t
  find_wday(int32_t g, wday_t w, int32_t n = 0) noexcept
  {
    return g + ((7 + w - wday(g)) % 7) + 7 * n;
  }
  /** // doc: clamp_year(y) {{{
   * @brief Correct year if out of range.
   * @param y a reference to year variable.
   * @return corrected year.
   */ // }}}
  constexpr static int32_t clamp_year(int32_t y) noexcept
  {
    return  (y < STM32XX_DATE_YEAR_MIN) ?  STM32XX_DATE_YEAR_MIN 
        :  ((y > STM32XX_DATE_YEAR_MAX) ?  STM32XX_DATE_YEAR_MAX : y);
  }
  /** // doc: clamp_year() {{{
   * @brief Correct month if out of range.
   * @param m a reference to month variable.
   * @return corrected month.
   */ // }}}
  constexpr static int32_t clamp_mon(int32_t m) noexcept
  {
    return (m < 1) ? 1 : ((m > 12) ? 12 : m);
  }
  /** // doc: clamp_mday() {{{
   * @brief Correct day of month if out of range.
   * @param y year, an integer in range <tt>[@ref STM32XX_DATE_YEAR_MIN ..
   *        @ref STM32XX_DATE_YEAR_MAX]</tt>,
   * @param m month, an integer in range <tt>[1 .. 12]</tt>,
   * @param d a reference to day of month variable.
   * @return corrected day of month.
   */ // }}}
  constexpr static int32_t clamp_mday(int32_t y, int32_t m, int32_t d) noexcept
  {
    return (d < 1) ? 1 : ((d > mdays(y,m)) ? mdays(y,m) : d);
  }
};

} /* namespace stm32xx */

/** // doc: operator+() {{{
 * @fn stm32xx::date stm32xx::operator+(stm32xx::date const&,int32_t)
 * @brief operator+()
 */ // }}}
inline stm32xx::date operator + (stm32xx::date const& d, int32_t days) noexcept
{
  stm32xx::date d2(d);
  d2.advance_date(days);
  return d2;
}
/** // doc: operator-() {{{
 * @fn stm32xx::date stm32xx::operator-(stm32xx::date const&,int32_t)
 * @brief operator-()
 */ // }}}
inline stm32xx::date operator - (stm32xx::date const& d, int32_t days) noexcept
{
  stm32xx::date d2(d);
  d2.advance_date(-days);
  return d2;
}

#endif /* STM32XX_DATE_HPP_INCLUDED */
// vim: set expandtab tabstop=2 shiftwidth=2:
// vim: set foldmethod=marker foldcolumn=4:
